app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1
INSERT INTO "comments" ("commenter", "body", "post_id", "created_at", "updated_at") VALUES ('sdfsd', 'asdfasdf', 1, '2012-02-02 16:53:25.026282', '2012-02-02 16:53:25.026282')
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(params[:comment])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1
SELECT "comments".* FROM "comments" WHERE "comments"."id" = 1 AND ("comments".post_id = 1) LIMIT 1
DELETE FROM "comments" WHERE "comments"."id" = 1
---
  def destroy
    @post = Post.find(params[:post_id])
    @comment = @post.comments.find(params[:id])
    @comment.destroy